---
kind: type
id: T:Autodesk.Revit.DB.DividedSurface
source: html/782e1ac7-4e74-9a32-6b03-0a20f7d55217.htm
---
# Autodesk.Revit.DB.DividedSurface

An element that represents a mesh on the surface of another element, a family instance, an import instance or a geometry combination,
 and a tile pattern built on that mesh.

## Syntax (C#)
```csharp
public class DividedSurface : Element
```

## Remarks
The type of this element may be set to:
 a TilePattern element,
 a FamilySymbol element from a Curtain Panel family.